In [3]:
import pandas as pd
import numpy as np
from pandas import Series 
from pandas import DataFrame

In [4]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
from IPython.display import display

## Pandas Data Structures

### Series

\begin{itemize}
\item A Series is a one-dimensional array-like object containing a sequence of values and an associated array of data labels,called its index.
\end{itemize}
index和value都是list

关于Series的操作  
更多操作可见Seciton4 

|Operation|Description|
|---|---|
|pd.Series()|
|obj.index()| 
|obj.sort_index()| 
|obj.sort_values()| 
||
|obj.idxmax()|获取最大值的index
|| 
|| 
|| 
||
||
||

In [8]:
numbers = [1,2,3,4,5,6,7,-1,-2,-3]
obj1 = pd.Series([numbers])
display(obj1)
display(obj1.values)
display(obj1.index)

0    [1, 2, 3, 4, 5, 6, 7, -1, -2, -3]
dtype: object

array([list([1, 2, 3, 4, 5, 6, 7, -1, -2, -3])], dtype=object)

RangeIndex(start=0, stop=1, step=1)

In [13]:
obj2 = Series([1,-1,2,4],index=['a','b','c','d'])
print(obj2)
print(obj2.values)
print(obj2.index)

a    1
b   -1
c    2
d    4
dtype: int64
[ 1 -1  2  4]
Index(['a', 'b', 'c', 'd'], dtype='object')

In [4]:
#索引
print(obj2[0:2])  #python的区间为左闭右开
print(obj2['a'])
print(obj2>0) # 返回Boole量
print(obj2[obj2>0]) # 可用Boole量进行索引

a    1
b   -1
dtype: int64
1
a     True
b    False
c     True
d     True
dtype: bool
a    1
c    2
d    4
dtype: int64

In [5]:
# 支持向量化运算
print(2*obj2)
print(obj2+obj2)
print(np.exp(obj2))

a    2
b   -2
c    4
d    8
dtype: int64
a    2
b   -2
c    4
d    8
dtype: int64
a     2.718282
b     0.367879
c     7.389056
d    54.598150
dtype: float64

In [7]:
# Dict -> Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [8]:
# 更换index
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
obj.index = ['Bob', 'Steve', 'jeff', 'Ryan']
obj

Bob      4
Steve    7
jeff    -5
Ryan     3
dtype: int64

### DataFrame

\begin{itemize}
\item A DataFrame represents a rectangular table of data and contains an ordered collection of culumns,each of which can be different value type. 
\item The DataFrame has both row and column index.
\end{itemize}

|Operation|Description|
|---|---|
|df.sort_values||
|df.columns||
|df.index||
|df.loc||
|df.iloc||
||

In [12]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [48]:
#df的特征
print(df.columns)
print(df.index)

Index(['state', 'year', 'pop'], dtype='object')
RangeIndex(start=0, stop=6, step=1)

In [49]:
df.head() #展示df的前5条数据

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [50]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [51]:
pd.DataFrame(data, columns=['year', 'state', 'pop','debt']) #没有定义的列用NA填充

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [52]:
df2 = pd.DataFrame(data, columns=['year', 'state', 'pop','debt'],
                  index=['one','two','three','four','five','six'])
df2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

df.iloc|df.loc改版后需要记住如下命令    
list(df.columns).index('year')

In [53]:
#df.loc
df2.loc[:,'year'] #取year列
df2.loc['one',:] #取0行
df2.loc[['one','two'],['year','pop']]

     year  pop
one  2000  1.5
two  2001  1.7

In [54]:
df2.iloc[[0,1],[0,1]]

     year state
one  2000  Ohio
two  2001  Ohio

In [55]:
df2.iloc[[0,1],[list(df2.columns).index('year'),list(df2.columns).index('pop')]]

     year  pop
one  2000  1.5
two  2001  1.7

In [56]:
df2['debt'] = np.arange(6)
df2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [57]:
df2['eastern'] = df2['state'] == 'Ohio'
df2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5     0     True
two    2001    Ohio  1.7     1     True
three  2002    Ohio  3.6     2     True
four   2001  Nevada  2.4     3    False
five   2002  Nevada  2.9     4    False
six    2003  Nevada  3.2     5    False

## Index

Index实质上和Set的操作差不多,不过Index允许元素重复  
关于Index的结构以及详细操作可见6.1

|Operation|Description|
|---|---|
|index.append()|
|index.difference()|
|index.intersection()| 
|index.union()| 
|index.isin()| 
|index.delete()|
|index.unique()|
|index.is_unique()|
|index.in_monotonic|
||
||

In [14]:
obj = pd.Series(range(3), index=['a','b','c'])
index = obj.index

In [15]:
#生成index对象
pd.Index(['d'])

Index(['d'], dtype='object')

In [18]:
index.append(pd.Index(['d']))

Index(['a', 'b', 'c', 'd'], dtype='object')

In [19]:
index.intersection(pd.Index(['d']))

Index([], dtype='object')

In [20]:
index.union(pd.Index(['a','d']))

Index(['a', 'b', 'c', 'd'], dtype='object')

In [21]:
index.difference(pd.Index(['a']))

Index(['b', 'c'], dtype='object')

In [22]:
index.isin(['a','b'])

array([ True,  True, False])

## Essential Functionality

### Reindexing

index function arguments     

|Operation|Description|
|---|---|
|index|
|method| 'ffill' fills forwards, while 'bfill' fills backward
|fill_value| Substitute value to use when introducing missing data by reindexing 
|limit|配合method使用，表示最多填充的个数
|tolernce|? 
|level|?
||
||

In [29]:
obj = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [30]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2 #缺失值用na填充

a   -5.0
b    7.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [31]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [32]:
obj3.reindex(range(6),method='ffill') #obj3 并没有发生改变

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [33]:
df = pd.DataFrame(np.arange(9).reshape((3,3)),
                 index=['a','c','d'],
                 columns=['Ohio', 'Texas', 'California'])
df

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [34]:
df2 = df.reindex(['a','b','c','d'],axis=0)
df2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [35]:
df2 = df.reindex(['Texas','Utah','California'],axis=1)
df2

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis

In [36]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [37]:
data.drop(['Colorado', 'Ohio'],axis=0) #data没有发生变换

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [38]:
data.drop(['Colorado', 'Ohio'],axis=0,inplace=True) #通过添加inplace = True使data改变

### Indexing,Selection,and Filtering

In [39]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [41]:
data[['one','two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [42]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [43]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [109]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [113]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Apply

In [116]:
df = pd.DataFrame(np.random.randn(4,3), columns=list('bde'),
                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [117]:
df

               b         d         e
Utah   -0.424642  1.908129 -0.145757
Ohio    1.146124 -0.065446 -0.113629
Texas   0.273564  0.806555 -1.169074
Oregon  0.167517 -1.118543  0.894908

In [119]:
np.abs(df)

               b         d         e
Utah    0.424642  1.908129  0.145757
Ohio    1.146124  0.065446  0.113629
Texas   0.273564  0.806555  1.169074
Oregon  0.167517  1.118543  0.894908

In [121]:
x = df.iloc[0,:]
x

b   -0.424642
d    1.908129
e   -0.145757
Name: Utah, dtype: float64

In [144]:
df.apply(lambda x:x.max()-x.min(),axis=1) #求每行的最大值与最小值，其中x的操作与Series相同

Utah      2.332772
Ohio      1.259753
Texas     1.975629
Oregon    2.013451
dtype: float64

In [145]:
df.applymap(lambda x: '%.2f' % x)

            b      d      e
Utah    -0.42   1.91  -0.15
Ohio     1.15  -0.07  -0.11
Texas    0.27   0.81  -1.17
Oregon   0.17  -1.12   0.89

不过，在这里我想弄清楚这里传递的x的结构，事实上   
axis=0代表按列传递  
axis=1代表按行传递  
下面两个例子说明了这一点

In [130]:
df.apply(lambda x:print(x),axis=0)

Utah     -0.424642
Ohio      1.146124
Texas     0.273564
Oregon    0.167517
Name: b, dtype: float64
Utah      1.908129
Ohio     -0.065446
Texas     0.806555
Oregon   -1.118543
Name: d, dtype: float64
Utah     -0.145757
Ohio     -0.113629
Texas    -1.169074
Oregon    0.894908
Name: e, dtype: float64

b    None
d    None
e    None
dtype: object

In [131]:
df.apply(lambda x:print(x),axis=1)

b   -0.424642
d    1.908129
e   -0.145757
Name: Utah, dtype: float64
b    1.146124
d   -0.065446
e   -0.113629
Name: Ohio, dtype: float64
b    0.273564
d    0.806555
e   -1.169074
Name: Texas, dtype: float64
b    0.167517
d   -1.118543
e    0.894908
Name: Oregon, dtype: float64

Utah      None
Ohio      None
Texas     None
Oregon    None
dtype: object

In [147]:
#lambda表达式也可以等价于下述式子，不过使用lambda表达式的好处在于我们不用每次都来定义一个函数
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])
def g(x):
    return x.min()

In [148]:
df.apply(g,axis=0)

b   -0.424642
d   -1.118543
e   -1.169074
dtype: float64

### Sorting and Ranking

In [149]:
#对Series排序
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [159]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [164]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [168]:
obj = pd.Series([7,-5,7,4,2,0,4])
obj.rank(ascending=True)

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [169]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [163]:
obj.sort_values(ascending=False) #NaN排在最后

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [152]:
#对DataFrame排序
df = pd.DataFrame(np.arange(8).reshape((2,4)),
                 index=['three', 'one'],
                 columns=['d', 'a', 'b', 'c'])
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [154]:
df.sort_index(axis=0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [158]:
df.sort_index(axis=1,ascending=False) #对列进行非升序排序

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### Axis Indexes with Duplicate Labels

In [171]:
obj = pd.Series(range(5), index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [172]:
obj.index.is_unique

False

In [173]:
obj['a']

a    0
a    1
dtype: int64

In [174]:
df = pd.DataFrame(np.random.randn(4,3), index=['a','a','b','b'])

In [175]:
df

          0         1         2
a  0.840274  0.315312  0.084806
a  0.201006 -0.043939  0.585017
b  0.811688 -1.266132  0.973808
b -1.161682  0.043891 -1.316358

In [176]:
df.loc['b',:]

          0         1         2
b  0.811688 -1.266132  0.973808
b -1.161682  0.043891 -1.316358

## Summarizing and Computing Descriptive Statistics

|Operation|Description|
|---|---|
|axis|
|skipna|
|level| 
|| 
|| 
||
||
||

|Operation|Description|
|---|---|
|x.count()| Numbers of non-NA values 
|x.describe()| 
|x.min()|
|x.argmin()| Compute index locations
|x.idxmin()| Compute index labels
|x.sum()| 
|x.mean()|
|x.mad()| Mean Absolute deviation from mean value
|x.prod()| Product of all values
|x.var()| 
|x.std()| 
|x.skew()|
|x.kurt()|
|x.cumsum()|
|x.cummin()|
|x.cumprod|
|x.diff|
|x.pct_change| Compute percent changes
||
||
||
||
||

In [177]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [180]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [182]:
df.sum(axis=1,skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [190]:
df.idxmax()

one    b
two    d
dtype: object

In [192]:
df.apply(lambda x:x.argmin(),axis=0)

one    3
two    1
dtype: int64

## Unique Values, Value Counts,and Membership

In [203]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [206]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [207]:
obj.value_counts() #元素计数

a    3
c    3
b    2
d    1
dtype: int64

In [208]:
obj.isin(['b','c'])

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [209]:
obj[obj.isin(['b','c'])]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [210]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [214]:
data.apply(lambda x:x.value_counts())

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [215]:
data.apply(lambda x:x.value_counts()).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0